app/views/listings/_form.html.haml

		%label Area
		= f.select :district_id, District.all.collect{ |d| [d.name, d.id] }, {}, { :class => 'form-control' }
	.form-group
		%label Property Type
		= f.select :dwelling_kind_id, DwellingKind.all.collect{ |d| [d.name, d.id] }, {}, { :class => 'form-control' }
	.form-group
---
SELECT "districts".* FROM "districts"
SELECT "dwelling_kinds".* FROM "dwelling_kinds"