app/views/listings/list.template.haml

				%td
					%img{ :src => listing.listing_pictures.first.avatar.thumb150.url }
				%td #{ link_to listing.title, listing_path(listing) }
				%td #{ District.find_by_id(listing.district_id).name }
				%td #{ DwellingKind.find_by_id(listing.dwelling_kind_id).name }
---
SELECT  "listing_pictures".* FROM "listing_pictures" WHERE "listing_pictures"."listing_id" = ?  ORDER BY "listing_pictures"."id" ASC LIMIT 1  [["listing_id", 2]]
SELECT  "listings".* FROM "listings"  ORDER BY "listings"."created_at" DESC LIMIT 20
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "dwelling_kinds".* FROM "dwelling_kinds" WHERE "dwelling_kinds"."id" = ? LIMIT 1  [["id", 1]]