app/views/listings/new.html.haml

									%select.form-control#area-input
										= options_from_collection_for_select(District.all, 'id', 'name')
								.form-group
---
SELECT "districts".* FROM "districts"

									%select.form-control#dwelling-kind-input
										= options_from_collection_for_select(DwellingKind.all, 'id', 'name')
								.form-group
---
SELECT "dwelling_kinds".* FROM "dwelling_kinds"