app/views/listings/show.template.haml

.col-xs-12
	- if @listing.listing_pictures.count == 0 then
		.well No Pictures Yet
---
SELECT "listing_pictures".* FROM "listing_pictures" WHERE "listing_pictures"."listing_id" = ?  [["listing_id", 1]]
SELECT COUNT(*) FROM "listing_pictures" WHERE "listing_pictures"."listing_id" = ?  [["listing_id", 1]]

				by
				- user = User.find_by_id(@listing.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

		%dt Area
		%dd #{ link_to District.find_by_id(@listing.district_id).name, district_listings_path(@listing.district_id) }
		%dt Dwelling Kind
		%dd #{ DwellingKind.find_by_id(@listing.dwelling_kind_id).name }
---
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "dwelling_kinds".* FROM "dwelling_kinds" WHERE "dwelling_kinds"."id" = ? LIMIT 1  [["id", 1]]