app/controllers/listings_controller.rb

SELECT  "listings".* FROM "listings"  ORDER BY "listings"."created_at" DESC LIMIT 20
---
	def index
		@listings = Listing.order(:created_at => :desc).limit(20)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def user_listings
		@user = User.find_by_id(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def new

		#reuse session data if available
		if session.has_key? :listing then
			@listing = User.find_by_id(params[:user_id]).listings.new( session[:listing] )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "listings" ("address", "description", "district_id", "dwelling_kind_id", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		#@listing = User.find_by_id(params[:user_id]).listings.new( Rack::Utils.parse_nested_query(params[:listing]) )
		@listing = User.find_by_id(params[:user_id]).listings.new( session[:listing])
		if @listing.save! then

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "listings" SET "description" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["description", "this is a test\r\nwhat a nice place in pandan jaya\r\nsecluded but yet, in the middle of everything"], ["updated_at", "2015-03-14 00:45:02.592448"], ["id", 1]]
---
	def update

		Rails.logger.info 'session[:listing]= ' +  session[:listing].inspect
		@listing = Listing.find_by_id(session[:listing]['id'])

		@listing.title = session[:listing]['title']
		@listing.address = session[:listing]['address']
		@listing.dwelling_kind_id = session[:listing]['dwelling_kind_id']
		@listing.district_id = session[:listing]['district_id']
		@listing.description = session[:listing]['description']

		if @listing.save! then

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = ? AND "listings"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
	def edit
		#session.delete :listing_pictures_id

		@user = User.find_by_id(params[:user_id])
		@listing = @user.listings.find_by_id(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
SELECT "listing_pictures".* FROM "listing_pictures" WHERE "listing_pictures"."listing_id" = ?  [["listing_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def show
		@listing = Listing.find_by_id(params[:id]) or not_found
		@listing_pictures = ListingPicture.where(:listing_id => @listing.id)
		@user = User.find_by_id(@listing.user_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
---
	def review
		@action = params[:action_taken]
		@user = User.find_by_id params[:user_id]


		if @action == 'new' then
			session[:listing] = params[:listing]
			@listing = User.find_by_id(params[:user_id]).listings.new( listing_params )

SELECT  "districts".* FROM "districts" WHERE "districts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "listings".* FROM "listings" WHERE "listings"."district_id" = ?  ORDER BY "listings"."created_at" DESC LIMIT 10  [["district_id", 1]]
---
	def district_listings
		@district = District.find_by_id(params[:district_id])
		@listings = @district.listings.order(:created_at => :desc).limit(10)