app/controllers/listing_pictures_controller.rb

	def create
		#for production
		#@listing_picture = ListingPicture.new(:avatar => params[:listing_pictures][0])
		#@listing_picture.save!

		#for testing, give back the first listing
		@listing_picture = ListingPicture.first
---
SELECT  "listing_pictures".* FROM "listing_pictures"  ORDER BY "listing_pictures"."id" ASC LIMIT 1