app/controllers/listing_pictures_controller.rb

	def create
		#for live
		@listing_picture = ListingPicture.new(:avatar => params[:listing_pictures].last)
		@listing_picture.save!
---
INSERT INTO "listing_pictures" ("avatar", "created_at", "updated_at") VALUES (?, ?, ?)  [["avatar", "KAR_8863.JPG"], ["created_at", "2015-03-14 06:08:09.769056"], ["updated_at", "2015-03-14 06:08:09.769056"]]

	def thumb
		@listing_picture = ListingPicture.find_by_id(params[:listing_picture_id])
---
SELECT  "listing_pictures".* FROM "listing_pictures" WHERE "listing_pictures"."id" = ? LIMIT 1  [["id", 1]]